# Приведите к целому типу число 2.99
print(int(2.99))

# Приведите к целому типу число -1.6
print(int(-1.6))

# Вычислите в python значение выражения: 9**19 - int(float(9**19))
print(9**19 - int(float(9**19)))

# Посмотреть какому типу принадлежат числа: 7 и 7.0
print(type(7))
print(type(7.0))